{
  "backend/main.mo": "Defines a canister with user profile storage and authorization checks for viewing and updating profiles.",
  "feature_evidence.json": "Lists feature-to-file mappings and component dependencies for implemented chat-related features.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files for build planning.",
  "frontend/index.css": "Tailwind base styles and theme variables defining color palettes for light and dark modes.",
  "frontend/index.html": "Minimal HTML shell loading the React app entry point.",
  "frontend/src/App.tsx": "Root React component handling authentication, profile loading, and layout rendering.",
  "frontend/src/components/chat/AttachmentPreview.tsx": "Renders previews for image, audio, or file attachments with remove‑attachment actions.",
  "frontend/src/components/chat/CameraCaptureDialog.tsx": "Modal dialog for capturing or selecting an image using camera or file input, handling preview, retake, and submission.",
  "frontend/src/components/chat/MessageComposer.tsx": "Chat input component supporting text, image/file attachments, camera capture, and voice recording before sending messages.",
  "frontend/src/components/chat/MessageList.tsx": "Renders chat messages with support for displaying image, audio, and file attachments along with timestamps.",
  "frontend/src/components/chat/types.ts": "Defines TypeScript types for chat messages and attachments.",
  "frontend/src/components/ChatWindow.tsx": "Chat UI container with message list, auto‑scroll, and message composer.",
  "frontend/src/components/CommentsDialog.tsx": "Empty file placeholder for a comments dialog component.",
  "frontend/src/components/EditProfileDialog.tsx": "Empty file placeholder for a profile editing dialog component.",
  "frontend/src/components/MainLayout.tsx": "Main layout with header, bottom navigation, and tab‑based routing between feed, chat, and profile.",
  "frontend/src/components/PostCard.tsx": "Empty file placeholder for a post card component.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting the user to enter and save their display name on first login.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useChatSession.ts": "Manages chat messages persisted in sessionStorage with helpers to add or clear messages.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, login/logout handling, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and saving the caller's user profile via the backend actor.",
  "frontend/src/hooks/useVoiceRecorder.ts": "Handles microphone recording with timers, error handling, and returns the final audio blob.",
  "frontend/src/index.css": "Defines Tailwind layers and custom OKLCH theme variables for light/dark mode plus global styles and scrollbar tweaks.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity context providers.",
  "frontend/src/pages/CreatePostPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/FeedPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/LoginPage.tsx": "Renders a styled login screen using Internet Identity with social links and loading states.",
  "frontend/src/pages/MessagesPage.tsx": "Displays the ChatWindow component inside a flexible layout.",
  "frontend/src/pages/NotificationsPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/ProfilePage.tsx": "Shows user profile info with Internet Identity data and provides a logout action.",
  "frontend/src/pages/SearchPage.tsx": "Empty placeholder page component.",
  "frontend/src/utils/diagnostics/formatError.ts": "Converts unknown errors into concise readable strings with optional stack trimming.",
  "frontend/src/utils/diagnostics/stepLogger.ts": "Provides timestamped logging helpers for step-based debugging with success and error variants.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and sessionStorage parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, color bindings to CSS variables, plugins, and animations.",
  "project_state.json": "Describes project state, features, and versioning for build planning metadata."
}